ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
void renderScreen() {
  displayStoredImage();
  displayCaption();
  renderUI();
}

void flashButton(const Button& btn) {
  tft.drawRect(btn.x - 2, btn.y - 2, btn.w + 4, btn.h + 4, ILI9341_WHITE);
  delay(120);
  renderUI();
}

void displayCaption() {
  if (currentCaption.length() == 0) return;
  const int capY = 42;
  const int capH = 22;
  tft.fillRect(0, capY, SCREEN_WIDTH, capH, ILI9341_BLACK);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(1);
  tft.setTextWrap(true);
  tft.setCursor(5, capY + 4);
  tft.print(currentCaption);
}

void showToast(const String& text) {
  toastText = text;
  toastUntil = millis() + 1500;
  tft.fillRect(60, 100, 200, 40, ILI9341_BLACK);
  tft.drawRect(60, 100, 200, 40, ILI9341_WHITE);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(2);
  tft.setCursor(80, 113);
  tft.print(text);
}

void clearToast() {
  if (toastUntil > 0 && millis() > toastUntil) {
    toastUntil = 0;
    renderScreen();
  }
}

// ---------------------------------------------------------------------------
// Touch handling
// ---------------------------------------------------------------------------
void handleTouch() {
  if (!touchReady) return;

  // Poll touched() FIRST: it triggers a fresh XPT2046 read.
  // Calling getPoint() first returns stale coordinates from the previous touch.
  bool isTouched = touch.touched();
  TS_Point p = touch.getPoint();

  if (!wasTouched && isTouched) {
    if (touchUpAt != 0 && millis() - touchUpAt < TOUCH_DEBOUNCE_MS) {
      return;  // Bounce right after release: ignore
    }
    // Contact just began: record sample count, don't trust coordinates yet.
    touchDownSamples = 0;
    touchMoved = false;
    wasTouched = true;
    return;
  }

  if (wasTouched && isTouched) {
    touchDownSamples++;
    if (touchDownSamples < TOUCH_SETTLE_SAMPLES) {
      return;  // Discard noisy early samples while pressure stabilizes
    }
    int x = mapTouchToScreenX(p.x);
    int y = mapTouchToScreenY(p.y);
    if (touchDownSamples == TOUCH_SETTLE_SAMPLES) {
      // First stable sample: anchor the gesture here
      touchStartX = x;
      touchStartY = y;
      touchLastX = x;
      touchLastY = y;
      Serial.printf("touch down: raw=%d,%d screen=%d,%d z=%d\n", p.x, p.y, x, y, p.z);
      return;
    }
    if (abs(x - touchStartX) > 5 || abs(y - touchStartY) > 5) touchMoved = true;

    if (drawModeActive && !isInAnyControl(x, y)) {
      drawLine(touchLastX, touchLastY, x, y);
    }
    touchLastX = x;
    touchLastY = y;
    return;
  }

  if (wasTouched && !isTouched) {
    wasTouched = false;
    touchUpAt = millis();
    Serial.printf("touch up: screen=%d,%d moved=%s\n", touchStartX, touchStartY, touchMoved ? "yes" : "no");
    if (!touchMoved && touchDownSamples >= TOUCH_SETTLE_SAMPLES) {
      handleTap(touchStartX, touchStartY);
    }
  }
}

void handleTap(int x, int y) {
  if (isInButton(x, y, heartBtn)) {
    Serial.println("tap: heart");
    flashButton(heartBtn);
    if (sendLikeFeedback()) {
      showToast("Liked!");
    } else {
      showToast("Like failed");
    }
    return;
  }

  if (toolbarVisible) {
    // Color swatch selection
    for (int i = 0; i < SWATCH_COUNT; i++) {
      const ColorSwatch& s = swatches[i];
      if (x >= s.x && x < s.x + s.w && y >= s.y && y < s.y + s.h) {
        activeColorIndex = i;
        Serial.printf("tap: color %d\n", i);
        renderUI();
        return;
      }
    }
    if (isInButton(x, y, drawBtn)) {
      Serial.println("tap: draw");
      flashButton(drawBtn);
      drawModeActive = !drawModeActive;
      renderUI();
    } else if (isInButton(x, y, clearBtn)) {
      Serial.println("tap: clear");
      flashButton(clearBtn);
      clearOverlay();
      renderScreen();
    } else if (isInButton(x, y, sendBtn)) {
      Serial.println("tap: send");
      flashButton(sendBtn);
      bool ok = sendDrawingFeedback();
      resetFeedbackState();
      renderScreen();
      showToast(ok ? "Sent!" : "Send failed");
    } else if (isInButton(x, y, closeBtn)) {
      Serial.println("tap: close");
      flashButton(closeBtn);
      drawModeActive = false;
      toolbarVisible = false;
      renderScreen();
    }
  } else {
    if (isInButton(x, y, penBtn)) {
      Serial.println("tap: pen");
      flashButton(penBtn);
      toolbarVisible = true;
      renderUI();
    }
  }
}

// ---------------------------------------------------------------------------
// Network feedback
// ---------------------------------------------------------------------------
bool sendLikeFeedback() {
  if (lastProcessedId.length() == 0) {
    Serial.println("like feedback: no message id");
    return false;
  }

  String url = String(API_HOST) + "/.netlify/functions/lovebox-feedback?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Feedback-Type", "like");
  http.setTimeout(HTTP_TIMEOUT_MS);

  String payload = "{\"type\":\"like\",\"messageId\":\"" + lastProcessedId + "\"}";
  int httpCode = http.POST(payload);
  http.end();

  Serial.printf("like feedback HTTP %d, id=%s\\n", httpCode, lastProcessedId.c_str());
  return httpCode == 200;
}

bool sendDrawingFeedback() {
  if (lastProcessedId.length() == 0 || !imageStorageReady || !FFat.exists(IMAGE_PATH)) {
    Serial.printf("draw feedback: not ready, id=%s, storage=%s, image=%s\n",
      lastProcessedId.c_str(),
      imageStorageReady ? "yes" : "no",
      FFat.exists(IMAGE_PATH) ? "yes" : "no");
    return false;
  }

  File imageFile = FFat.open(IMAGE_PATH, FILE_READ);
  if (!imageFile || imageFile.size() != IMAGE_SIZE) {
    if (imageFile) imageFile.close();
    return false;
  }

  uint8_t* composed = new uint8_t[IMAGE_SIZE];
  if (!composed) {
    imageFile.close();
    return false;
  }

  if (imageFile.read(composed, IMAGE_SIZE) != IMAGE_SIZE) {
    delete[] composed;
    imageFile.close();
    return false;
  }
  imageFile.close();

  for (int y = 0; y < SCREEN_HEIGHT; y++) {
    for (int x = 0; x < SCREEN_WIDTH; x++) {
      if (getOverlayPixel(x, y)) {
        int idx = (y * SCREEN_WIDTH + x) * 2;
        composed[idx] = 0xFF;
        composed[idx + 1] = 0xFF;
      }
    }
  }

  String url = String(API_HOST) + "/.netlify/functions/lovebox-feedback?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/octet-stream");
  http.addHeader("X-Feedback-Type", "draw");
  http.addHeader("X-Message-Id", lastProcessedId);
  http.setTimeout(HTTP_TIMEOUT_MS);

  int httpCode = http.sendRequest("POST", composed, IMAGE_SIZE);
  http.end();

