ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
  delete[] composed;
  Serial.printf("draw feedback HTTP %d, id=%s\n", httpCode, lastProcessedId.c_str());
  return httpCode == 200;
}

bool sendHealthReport() {
  if (WiFi.status() != WL_CONNECTED) return false;

  JsonDocument doc;
  doc["deviceId"] = DEVICE_ID;
  doc["firmwareVersion"] = FIRMWARE_VERSION;
  doc["uptimeMs"] = millis();
  doc["wifiRssi"] = WiFi.RSSI();
  doc["freeHeap"] = ESP.getFreeHeap();
  doc["psramTotal"] = ESP.getPsramSize();
  doc["psramFree"] = ESP.getFreePsram();
  doc["ffatMounted"] = imageStorageReady;
  doc["ffatTotal"] = imageStorageReady ? FFat.totalBytes() : 0;
  doc["ffatUsed"] = imageStorageReady ? FFat.usedBytes() : 0;
  doc["resetReason"] = static_cast<int>(esp_reset_reason());
  doc["lastSuccessfulCommunicationMs"] = lastSuccessfulCommunicationAt;
  doc["lastMessageId"] = lastProcessedId;
  doc["displayReady"] = displayReady;
  doc["touchReady"] = touchReady;
  doc["audioReady"] = false;
  doc["servoReady"] = servoReady;

  String payload;
  serializeJson(doc, payload);

  String url = String(API_HOST) + "/.netlify/functions/lovebox-health?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(HTTP_TIMEOUT_MS);
  int httpCode = http.POST(payload);
  http.end();

  Serial.printf("health HTTP %d, firmware=%s\n", httpCode, FIRMWARE_VERSION);
  return httpCode == 200;
}

int compareFirmwareVersions(const String& left, const String& right) {
  int leftMajor = 0, leftMinor = 0, leftPatch = 0;
  int rightMajor = 0, rightMinor = 0, rightPatch = 0;
  if (sscanf(left.c_str(), "%d.%d.%d", &leftMajor, &leftMinor, &leftPatch) != 3 ||
      sscanf(right.c_str(), "%d.%d.%d", &rightMajor, &rightMinor, &rightPatch) != 3) {
    return 0;
  }
  if (leftMajor != rightMajor) return leftMajor > rightMajor ? 1 : -1;
  if (leftMinor != rightMinor) return leftMinor > rightMinor ? 1 : -1;
  if (leftPatch != rightPatch) return leftPatch > rightPatch ? 1 : -1;
  return 0;
}

bool isSha256Hex(const String& value) {
  if (value.length() != 64) return false;
  for (size_t index = 0; index < value.length(); index++) {
    if (!isxdigit(value[index])) return false;
  }
  return true;
}

bool checkForFirmwareUpdate() {
  if (WiFi.status() != WL_CONNECTED) return false;

  String manifestUrl = String(API_HOST) + "/.netlify/functions/lovebox-firmware?deviceId=" + DEVICE_ID;
  http.begin(secureClient, manifestUrl);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(HTTP_TIMEOUT_MS);
  int httpCode = http.GET();
  if (httpCode != 200) {
    Serial.printf("firmware manifest HTTP %d\n", httpCode);
    http.end();
    return false;
  }

  String payload = http.getString();
  http.end();

  JsonDocument manifest;
  if (deserializeJson(manifest, payload) || !manifest["ok"].as<bool>()) {
    Serial.println("firmware manifest invalid");
    return false;
  }

  String version = manifest["data"]["version"].as<String>();
  String downloadUrl = manifest["data"]["url"].as<String>();
  String expectedSha256 = manifest["data"]["sha256"].as<String>();
  if (compareFirmwareVersions(version, FIRMWARE_VERSION) <= 0 ||
      !downloadUrl.startsWith("https://") || !isSha256Hex(expectedSha256)) {
    Serial.printf("no valid firmware update: version=%s\n", version.c_str());
    return false;
  }

  Serial.printf("firmware update available: %s -> %s\n", FIRMWARE_VERSION, version.c_str());
  http.begin(secureClient, downloadUrl);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(DOWNLOAD_TIMEOUT_MS);
  http.useHTTP10(false);
  httpCode = http.GET();
  int contentLength = http.getSize();
  if (httpCode != 200 || contentLength <= 0 || static_cast<size_t>(contentLength) > OTA_MAX_IMAGE_SIZE) {
    Serial.printf("firmware download rejected: HTTP %d, size=%d\n", httpCode, contentLength);
    http.end();
    return false;
  }

  if (!Update.begin(contentLength)) {
    Serial.printf("OTA begin failed: %s\n", Update.errorString());
    http.end();
    return false;
  }

  mbedtls_sha256_context sha256;
  mbedtls_sha256_init(&sha256);
  mbedtls_sha256_starts(&sha256, 0);
  WiFiClient* stream = http.getStreamPtr();
  uint8_t buffer[1024];
  size_t received = 0;
  bool writeOk = true;
  while (received < static_cast<size_t>(contentLength)) {
    size_t available = stream->available();
    if (available == 0) {
      delay(1);
      continue;
    }
    size_t requested = min(available, sizeof(buffer));
    int bytesRead = stream->readBytes(buffer, requested);
    if (bytesRead <= 0 || Update.write(buffer, bytesRead) != static_cast<size_t>(bytesRead)) {
      writeOk = false;
      break;
    }
    mbedtls_sha256_update(&sha256, buffer, bytesRead);
    received += bytesRead;
  }

  unsigned char digest[32];
  mbedtls_sha256_finish(&sha256, digest);
  mbedtls_sha256_free(&sha256);
  http.end();

  String actualSha256;
  char hex[3];
  for (size_t index = 0; index < sizeof(digest); index++) {
    snprintf(hex, sizeof(hex), "%02x", digest[index]);
    actualSha256 += hex;
  }

  if (!writeOk || received != static_cast<size_t>(contentLength) || actualSha256 != expectedSha256) {
    Serial.printf("OTA verification failed: received=%u/%d\n", received, contentLength);
    Update.abort();
    return false;
  }
  if (!Update.end(true)) {
    Serial.printf("OTA finalize failed: %s\n", Update.errorString());
    return false;
  }

  Serial.println("OTA installed; rebooting");
  delay(250);
  ESP.restart();
  return true;
}

// ---------------------------------------------------------------------------
// Setup
// ---------------------------------------------------------------------------
void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.setDebugOutput(true);
  Serial.println("Lovebox boot");
  esp_ota_mark_app_valid_cancel_rollback();

  // TFT setup
  tft.begin();
  displayReady = true;
  tft.setRotation(1);
  Serial.println("TFT initialized");
  tft.fillScreen(ILI9341_BLACK);

